GT1/GT1/laminar/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 1e-12;
internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type	          kqRWallFunction;
        value             uniform 1e-12;
	//value           $internalField;

        //type	          kLowReWallFunction;
        //value            uniform 1e-12;
    }

    front
    {
        //type            empty;
	type		wedge;
    }

    back
    {
        //type            empty;
	type		wedge;
    }
    bottom
    {
        type            symmetry;
    }
}

// ************************************************************************* //
