GT1/GT1/laminar/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
(-4.76384593631 -4.82081886603e-21 5.13270912136e-24)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
